import { Title, Wrapper, Text, TextAttention, Paragraph, Textblock, List, Listitem  } from './Services.styled';
import ServiceImg from '../../img/Poslugi_kompanii-1.jpg';
import { ConsultationForm } from 'components/ConsultationForm/ConsultationForm';
import { Footer } from 'components/Footer/Footer';

export const Services = () => {

    return (
        <>
        <Wrapper>
                <img src={ServiceImg} alt='service img' height='458' width='1000'/>
                <Title>Перелік послуг ТОВ «Екологічний консалтинг»</Title>
                <Text>Під екологічним консалтингом мається на увазі цілий комплекс робіт,
                    необхідних для забезпечення правильної діяльності підприємств будь-яких галузей.
                    Наші послуги дозволяють розробити більш ефективні проекти з ресурсозбереження,
                    знизити забруднення навколишнього середовища, антропогенне навантаження,
                    а також виконують низку інших завдань, пов’язаних з діяльністю компаній.</Text>
                <TextAttention>Список послуг, що надаються:</TextAttention>
                <Paragraph>1. Дозвіл на викиди в атмосферу</Paragraph>
                <Text>Оформлюється для організацій,
                    в ході діяльності яких утворюються викиди,
                    здатні нашкодити атмосфері або навколишньому середовищу.
                    Дозвіл повинен отримуватися на кожен об’єкт,
                    що здійснює шкідливі викиди в атмосферу.</Text>
                <Paragraph>2. Дозвіл на спеціальне водокористування</Paragraph>
                <Text>Документ, що дозволяє юридичним і фізичним особам використовувати
                    водні ресурси з метою здійснення певної діяльності.
                    До водних ресурсів відносяться: артезіанські свердловини,
                     водойми, басейни, озера, річки і т. д.
                </Text>
                <Paragraph>3. Оцінка впливу на довкілля (ОВД)</Paragraph>
                <Text>ОВД виявляє будь-які поточні і потенційні
                    небезпеки для навколишнього середовища при плануванні
                    господарської діяльності. Фахівці визначають інтенсивність і
                    ступінь небезпеки будь-якого виду для навколишнього середовища і
                    здоров’я людей, а також дають рекомендації щодо їх усунення і профілактики.
                </Text>
                <Paragraph>4. Розробка розділу (ОВНС)</Paragraph>
                <Text>Мета проведення ОВНС – розробка необхідних заходів
                    щодо попередження шкідливої ​​дії планової господарської діяльності
                    на навколишнє середовище або мінімізація такого впливу
                    при неможливості його повного усунення. ОВНС проводиться
                    на етапі проектування, ще до початку будівництва об’єкта.
                </Text>
                <Paragraph>5. Реєстрація декларації про відходи</Paragraph>
                <Text>Документ подається один раз на рік через електронну систему,
                    якщо діяльність суб’єкта господарювання призводить до утворення небезпечних відходів
                    або власників відходів, що не є небезпечними,
                    річний обсяг утворення яких перевищує 50 тонн, до 20 лютого
                    в електронному вигляді. Дані передаються для звітності до Міністерства природи України.
                </Text>
                <Paragraph> 6. Розробка реєстрових карт</Paragraph>
                <Text>Реєстрова карта відходів — це документ,
                    який повинні складати власники будь-яких об’єктів відходів
                    або ж компанії, діяльність яких пов’язана з утворенням
                    (Пзув більше 1000 у.о.) або переробкою відходів.
                 </Text>
                <Textblock>
                    <TextAttention>
                        Переваги співпраці з ТОВ «Екологічний консалтинг»
                    </TextAttention>
                        <Text>
                            До перевірки діяльності компанії екологічною інспекцією
                            може перетворитися на справжній кошмар.
                            Особливо якщо в штаті немає професійного еколога,
                            відсутнє розуміння самого проходження процедури,
                            а сумніви з приводу правильності організації всіх процесів досить вагомі.
                            Наші фахівці готові допомогти клієнту в таких випадках:
                        </Text>
                    <List>
                        <Listitem>Надання інструкції з проходження перевірки.</Listitem>
                        <Listitem>Ретельний аналіз діяльності компанії по відношенню до навколишнього середовища (еко-аудит).</Listitem>
                        <Listitem>Рекомендації щодо вжиття заходів, які дозволяють знизити шкоду, яка наноситься екології.</Listitem>
                </List>
                <Text>Інформацію можна отримати вже зараз, зателефонувавши за телефонами,
                    вказаними на сайті. Професійний консультант відповість на всі питання і
                    прийме вашу заявку.
                </Text>
                </Textblock>
           
        </Wrapper>
         <ConsultationForm />
            <Footer />
            </>
    )


}