import { Wrapper, Title, Text, Span } from './CompanyAbout.styled';
import AboutImg from '../../img/about-1.jpg';
import { Footer } from 'components/Footer/Footer';

export const CompanyAbout = () => {

    return (
        <>
            <Wrapper>
                <Title>Про нас</Title>
                <Text>
                    Компанія<Span> ТОВ «Екологічний консалтинг»</Span> надає
                    професійні послуги підприємствам з питань, що стосуються охорони
                    навколишнього природного середовища.
                </Text>
                <Text>
                    Наша команда – професіонали своєї справи,
                    які вміло поєднують знання міжнародних стандартів
                    екологічного консультування з бездоганним розумінням чинного законодавства.
                </Text>
                <Text>
                    Ми націлені на якість роботи.
                </Text>
                <Text>
                    Нашими  клієнтами  є  великі  підприємства  різних  галузей  народного господарства
                    і промисловості, фахівці  ТОВ «Екологічний консалтинг» надають послуги,
                    для виконання яких необхідний спеціальний дозвіл Мінприроди.
                </Text>
                <Text>
                    Крім цього, ми працюємо з підприємствами малого бізнесу,
                    які не мають в своєму складі штатного еколога.
                    Співробітники нашої компанії на час замінять Вам даного фахівця
                    і нададуть консалтингові послуги з усіх питань, пов’язаних з екологією,
                    в тому числі і складання звітності, вивезення відходів, розрахунок екологічного податку,
                    приведення документації підприємства у відповідність екологічному законодавству,
                    підготовка до перевірок екологічної інспекції.
                </Text>
                <Text>
                    Наша компанія давно на ринку екологічних послуг і зарекомендувала
                    себе як порядна і відповідальна, з сильною командою привітних
                    і компетентних фахівців, які знають і люблять свою справу,
                    виконують роботу в зазначені терміни.
                </Text>
                <Text>
                    Ми за чисте майбутнє для наступних поколінь, воно залежить саме від нас –
                    від кожного з нас, і
                    кожен може внести свій неоціненний внесок.
                </Text>
                <Text>
                    Давайте будувати його разом тут і зараз!
                </Text>
                  <img src={AboutImg} alt='about img' height='458' width='1000'/>
            </Wrapper>
          
            <Footer />
        </>

    )


}