import { Wrapper, Title, List, ListText } from './Law.styled';
import { Footer } from 'components/Footer/Footer';

const documents = [
    "Закон України «Про відходи».",
  "Закон України «Про охорону навколишнього природного середовища».",
  "Постанова КМУ № 2034 від 01.11.1999 р. «Про затвердження Порядку ведення державного обліку та паспортизації відходів».",
  "Постанова КМУ «Про затвердження Порядку класифікації відходів та Національного переліку відходів» від 20 жовтня 2023 р. № 1102.",
  "Постанова КМУ № 1120 від 13 липня 2000 р. «Про затвердження Положення про контроль за транскордонними перевезеннями небезпечних відходів та їх утилізацією/видаленням і Жовтого та Зеленого переліків відходів».",
  "Національний перелік відходів, затверджений Постановою КМУ «Про затвердження Порядку класифікації відходів та Національного переліку відходів» від 20 жовтня 2023 р. № 1102.",
  "Постанова КМУ від 20.06.95 №440 «Про затвердження Порядку одержання дозволів на виробництво, зберігання, транспортування, використання, захоронення, знищення та утилізацію отруйних речовин в тому числі продуктів біотехнологій та інших біологічних агентів».",
  "Постанова КМУ від 01.03.99 №303 «Про затвердження Порядку встановлення нормативів збору за забруднення навколишнього природного середовища і стягнення цього збору».",
  "Постанова КМУ від 01.11.99 №2034 «Про затвердження Порядку ведення державного обліку та паспортизації відходів».",
  "Постанова КМУ від 03.08.98 №1216 «Про затвердження Порядку ведення реєстру МВВ».",
  "Постанова КМУ від 31.08.98 №1360 «Про затвердження порядку ведення реєстру ОУВ та ООУВ».",
  "Закон України «Про охорону атмосферного повітря».",
  "Закон України «Про дозвільну систему у сфері господарської діяльності».",
  "Постанова КМУ від 13.03.02 №302 «Про затвердження Порядку проведення та оплати робіт, пов’язаних з видачею дозволу на викиди забруднюючих речовин в атмосферне повітря стаціонарними джерелами, обліку підприємств, установ, організацій та громадян — суб’єктів підприємницької діяльності, які отримали такі дозволи».",
  "Наказ Мінприроди України від 10.02.95 №7 «Про затвердження інструкції про зміст та порядок складання звіту проведення інвентаризації викидів забруднюючих речовин на підприємстві».",
  "Наказ Міністерства охорони навколишнього природного середовища України від 09.03.06 №108 «Про затвердження Інструкції про загальні вимоги до оформлення документів, у яких обґрунтовуються обсяги викидів, для отримання дозволу на викиди забруднюючих речовин в атмосферне повітря стаціонарними джерелами для підприємств, установ, організацій та громадян-підприємців».",
  "Водний кодекс України.",
  "МЕТОДИКА розрахунку розмірів відшкодування збитків, заподіяних державі внаслідок порушення законодавства про охорону та раціональне використання водних ресурсів.",
  "ПОРЯДОК розроблення і затвердження нормативів гранично допустимого скидання забруднюючих речовин.",
  "ІНСТРУКЦІЯ щодо заповнення форми N 2-ТП (водгосп).",
  "Постанова КМУ від 03.08.09 №1218 «Про затвердження Порядку розроблення, затвердження і проведення...».",
  "Закон України «Про дозвільну систему у сфері господарської діяльності».",
  "Закон України «Про охорону навколишнього природного середовища».",
  "Постанова КМУ від 13.03.02, №321 «Про затвердження порядку погодження та видачі дозволів на спеціальне водокористування та внесення змін до постанови КМУ від 10.08.92 р. №459».",
  "Постанова КМУ №1100 від 11.09.96 р. «Про порядок розроблення і затвердження гранично допустимого скидання забруднюючих речовин, скидання яких нормується».",
  "Постанова КМУ №465, від 25.03.99 р. «Про затвердження правил охорони поверхневих вод від забруднення зворотними водами».",
  "Постанова КМУ №526 від 21.05.09 р.",
  "ДБН В.1.2-8-2008 Основні вимоги до будівель і споруд. Безпека життя і здоров’я людини і захист довкілля.",
  "ДБН В.1.1-12: 2006 Будівництво в сейсмічних районах України.",
  "ДБН В.2.2-15-2005 Житлові будинки. Основні положення.",
  "ДБН В.2.3-4: 2007 Автомобільні дороги.",
  "ДБН В.2.3-5-2001 Вулиці і дороги населених пунктів.",
  "ДБН В.2.3-15: 2007 Автостоянки і гаражі для легкових автомобілів.",
  "ДСП173-96 Санітарні правила планування і забудови населених пунктів.",
  "ДБН В.1.2-9-2008 Основні вимоги до будівель і споруд. Безпека експлуатації.",
  "ДБН А.2.2-1-2003 Склад і зміст матеріалів оцінки впливу на навколишнє середовище (ОВНС) при будівництві та проектуванні підприємств, будівель і споруд.",
  "Закон України «Про інвестиційну діяльність».",
  "Закон України «Про екологічну експертизу».",
  "Постанова Кабінету Міністрів України від 20.08.2008 № 767 «Про затвердження Порядку проведення державної експертизи з питань техногенної безпеки проектів будівництва об’єктів, які можуть спричинити виникнення надзвичайної ситуації техногенного і природного характеру і вплинути на стан захисту населення і територій, і перелік вказаних об’єктів».",
  "Постанова КМУ від 27.07.1995 № 554 «Про перелік видів діяльності і об’єктів, що становлять підвищену екологічну небезпеку».",
  "ДБН А.2.2-1-2003 «Склад і вміст матеріалів оцінки впливу на навколишнє середовище (ОВНС) при проектуванні і будівництві підприємств, будівель і споруд». Київ, 2004 р.",
  "ДБН 360-92 ** «Планування і забудова міських і сільських поселень». Містобудування, Київ, 2003 р.",
  "СНіП2.01.01-82 «Будівельна кліматологія і геофізика».",
  "Закон України «Про архітектурну діяльність».",
  "Закон України «Про регулювання містобудівної діяльності».",
    "Закон України «Про основи містобудування",
    "ГСП «Державних санітарних правил планування і забудови населених пунктів» № 173 від 19.06.96.",
    "ДБН Б.1-3-97 «Склад, вміст, порядок розробки і затвердження генеральних планів міських населених пунктів». Держбуд України. 1997.",
    "СНіП2.04.03-85.",
    "«Правила охорони поверхневих вод», 1991г.",
    "ДБН.А.3.1-5-96«Організація будівельного виробництва».",
    "Постанова Кабінету Міністрів «Про затвердження Програми поводження з твердими побутовими відходами» (від 04.03. 2004 р. № 265).",
    "ДБН А.2.2-3-2011 «Склад і зміст проектної документації на будівництво об’єктів».",
    "Закон України від 18.01.2001 № 2245-ІІІ «Про об’єкти підвищеної небезпеки».",
    "Постанова Кабінету Міністрів України від 25.03.99 № 465 «Про затвердження Правил охорони поверхневих вод від забруднення стічними водами».",
    "Постанова Кабінету Міністрів України від 27.04.2011 № 557 «Про затвердження Порядку віднесення об’єктів будівництва до IV та V категорій складності.",
    "Закон України «Про благоустрій населених пунктів».",
    "Постанова Кабінету Міністрів України від 1 серпня 2006г. № 1045 «Про затвердження Порядку видалення дерев, кущів, газонів і квітників в населених пунктах».",
    "Наказ Міністерства будівництва, архітектури і житлово-комунального господарства України від 10.04.2006 № 105 «Про затвердження Правил утримання зелених насаджень в населених пунктах України».",
    "Закон України «Про екологічний аудит».",
    "Кодекс України «Про надра».",
  "Регламент погодження Мінприроди України надання надр у користування, затверджений Наказом Мінприроди України № 262 від 26.07.2011.",
]


export const Law = () => { 

    return (
        <>
            <Wrapper>
            <Title>Основні закони України в сфері екології:</Title>
            <List>
              {documents.map((document, index) => (
                <ListText key={index}>{document}</ListText>
                ))}
            </List>
        
            </Wrapper>
            <Footer/>
        </>
    )
}